garyPenhook/PIC-Assembler/edc/PIC18F56Q43.PIC
        <edc:SFRDef edc:access="rrrrrr-r" edc:cname="OSCSTAT" edc:desc="" edc:impl="0xfd" edc:isindirect="false" edc:isvolatile="true" edc:mclr="qqqqqq-q" edc:name="OSCSTAT" edc:nzwidth="8" edc:por="qqqqqq-q" edc:_addr="0xB2">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="OSCSTAT1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PLLR" edc:mask="0x1" edc:name="PLLR" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADOR" edc:mask="0x1" edc:name="ADOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SOR" edc:mask="0x1" edc:name="SOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LFOR" edc:mask="0x1" edc:name="LFOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MFOR" edc:mask="0x1" edc:name="MFOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HFOR" edc:mask="0x1" edc:name="HFOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EXTOR" edc:mask="0x1" edc:name="EXTOR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnn-n" edc:cname="OSCEN" edc:desc="" edc:impl="0xfd" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000-0" edc:name="OSCEN" edc:nzwidth="8" edc:por="000000-0" edc:_addr="0xB3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PLLEN" edc:mask="0x1" edc:name="PLLEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADOEN" edc:mask="0x1" edc:name="ADOEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SOSCEN" edc:mask="0x1" edc:name="SOSCEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LFOEN" edc:mask="0x1" edc:name="LFOEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MFOEN" edc:mask="0x1" edc:name="MFOEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HFOEN" edc:mask="0x1" edc:name="HFOEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EXTOEN" edc:mask="0x1" edc:name="EXTOEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------n" edc:cname="PRLOCK" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="PRLOCK" edc:nzwidth="8" edc:por="-------0" edc:_addr="0xB4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRLOCKED" edc:mask="0x1" edc:name="PRLOCKED" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="SCANPR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="SCANPR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0xB5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SCANPR" edc:mask="0x7" edc:name="SCANPR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SCANPR0" edc:mask="0x1" edc:name="SCANPR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCANPR1" edc:mask="0x1" edc:name="SCANPR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCANPR2" edc:mask="0x1" edc:name="SCANPR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="DMA1PR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="DMA1PR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0xB6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DMA1PR" edc:mask="0x7" edc:name="DMA1PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DMA1PR0" edc:mask="0x1" edc:name="DMA1PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1PR1" edc:mask="0x1" edc:name="DMA1PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1PR2" edc:mask="0x1" edc:name="DMA1PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="DMA2PR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="DMA2PR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0xB7">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DMA2PR" edc:mask="0x7" edc:name="DMA2PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DMA2PR0" edc:mask="0x1" edc:name="DMA2PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2PR1" edc:mask="0x1" edc:name="DMA2PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2PR2" edc:mask="0x1" edc:name="DMA2PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="DMA3PR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="DMA3PR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0xB8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DMA3PR" edc:mask="0x7" edc:name="DMA3PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DMA3PR0" edc:mask="0x1" edc:name="DMA3PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3PR1" edc:mask="0x1" edc:name="DMA3PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3PR2" edc:mask="0x1" edc:name="DMA3PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
