garyPenhook/PIC-Assembler/edc/PIC18F56Q43.PIC
        <edc:JoinedSFRDef edc:cname="CCPR1" edc:desc="" edc:name="CCPR1" edc:nzwidth="0x10" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x340">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR1L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x340">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RL" edc:desc="" edc:mask="0xff" edc:name="RL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR1H" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x341">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RH" edc:desc="" edc:mask="0xff" edc:name="RH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="CCP1CON" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="CCP1CON" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x342">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0xf" edc:name="MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="FMT" edc:desc="" edc:mask="0x1" edc:name="FMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE3" edc:desc="" edc:mask="0x1" edc:name="MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP1MODE" edc:desc="" edc:mask="0xf" edc:name="CCP1MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="CCP1FMT" edc:desc="" edc:mask="0x1" edc:name="CCP1FMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1OUT" edc:desc="" edc:mask="0x1" edc:name="CCP1OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CCP1EN" edc:desc="" edc:mask="0x1" edc:name="CCP1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP1MODE0" edc:desc="" edc:mask="0x1" edc:name="CCP1MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1MODE1" edc:desc="" edc:mask="0x1" edc:name="CCP1MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1MODE2" edc:desc="" edc:mask="0x1" edc:name="CCP1MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1MODE3" edc:desc="" edc:mask="0x1" edc:name="CCP1MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CCP1CAP" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CCP1CAP" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x343">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CTS" edc:desc="" edc:mask="0xf" edc:name="CTS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="CTS0" edc:desc="" edc:mask="0x1" edc:name="CTS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTS1" edc:desc="" edc:mask="0x1" edc:name="CTS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTS2" edc:desc="" edc:mask="0x1" edc:name="CTS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTS3" edc:desc="" edc:mask="0x1" edc:name="CTS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP1CTS" edc:desc="" edc:mask="0xf" edc:name="CCP1CTS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP1CTS0" edc:desc="" edc:mask="0x1" edc:name="CCP1CTS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1CTS1" edc:desc="" edc:mask="0x1" edc:name="CCP1CTS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1CTS2" edc:desc="" edc:mask="0x1" edc:name="CCP1CTS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1CTS3" edc:desc="" edc:mask="0x1" edc:name="CCP1CTS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="CCPR2" edc:desc="" edc:name="CCPR2" edc:nzwidth="0x10" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x344">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR2L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR2L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x344">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RL" edc:desc="" edc:mask="0xff" edc:name="RL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
