garyPenhook/PIC-Assembler/edc/PIC18F56Q43.PIC
        <edc:SFRDef edc:access="nn-n-n-n" edc:cname="ADCON0" edc:desc="" edc:impl="0xd5" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-0-0-0" edc:name="ADCON0" edc:nzwidth="0x8" edc:por="00-0-0-0" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3F3">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GO" edc:desc="" edc:mask="0x1" edc:name="GO" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FM" edc:mask="0x1" edc:name="FM" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x1" edc:name="CS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CONT" edc:desc="" edc:mask="0x1" edc:name="CONT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADGO" edc:mask="0x1" edc:name="ADGO" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADFM" edc:mask="0x1" edc:name="ADFM" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="ADCS" edc:mask="0x1" edc:name="ADCS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCONT" edc:mask="0x1" edc:name="ADCONT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADON" edc:mask="0x1" edc:name="ADON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DONE" edc:mask="0x1" edc:name="DONE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FM0" edc:mask="0x1" edc:name="FM0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="GO_nDONE" edc:mask="0x1" edc:name="GO_nDONE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADFM0" edc:mask="0x1" edc:name="ADFM0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn----n" edc:cname="ADCON1" edc:desc="" edc:impl="0xe1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000----0" edc:name="ADCON1" edc:nzwidth="0x8" edc:por="000----0" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3F4">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DSEN" edc:desc="" edc:mask="0x1" edc:name="DSEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GPOL" edc:desc="" edc:mask="0x1" edc:name="GPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IPEN" edc:desc="" edc:mask="0x1" edc:name="IPEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PPOL" edc:desc="" edc:mask="0x1" edc:name="PPOL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADDSEN" edc:desc="" edc:mask="0x1" edc:name="ADDSEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADGPOL" edc:mask="0x1" edc:name="ADGPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADIPEN" edc:mask="0x1" edc:name="ADIPEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADPPOL" edc:mask="0x1" edc:name="ADPPOL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADCON2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADCON2" edc:nzwidth="0x8" edc:por="00000000" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3F5">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MD" edc:desc="" edc:mask="0x7" edc:name="MD" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="ACLR" edc:desc="" edc:mask="0x1" edc:name="ACLR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRS" edc:desc="" edc:mask="0x7" edc:name="CRS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="PSIS" edc:desc="" edc:mask="0x1" edc:name="PSIS" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADMD0" edc:desc="" edc:mask="0x1" edc:name="ADMD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADMD1" edc:desc="" edc:mask="0x1" edc:name="ADMD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADMD2" edc:desc="" edc:mask="0x1" edc:name="ADMD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACLR" edc:mask="0x1" edc:name="ADACLR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCRS0" edc:desc="" edc:mask="0x1" edc:name="ADCRS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCRS1" edc:desc="" edc:mask="0x1" edc:name="ADCRS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCRS2" edc:desc="" edc:mask="0x1" edc:name="ADCRS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADPSIS" edc:mask="0x1" edc:name="ADPSIS" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ADMD" edc:mask="0x7" edc:name="ADMD" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCRS" edc:mask="0x7" edc:name="ADCRS" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="MD0" edc:desc="" edc:mask="0x1" edc:name="MD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MD1" edc:desc="" edc:mask="0x1" edc:name="MD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MD2" edc:desc="" edc:mask="0x1" edc:name="MD2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CRS0" edc:desc="" edc:mask="0x1" edc:name="CRS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRS1" edc:desc="" edc:mask="0x1" edc:name="CRS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRS2" edc:desc="" edc:mask="0x1" edc:name="CRS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="ADCON3" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="ADCON3" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3F6">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMD" edc:mask="0x7" edc:name="TMD" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="SOI" edc:mask="0x1" edc:name="SOI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CALC" edc:mask="0x7" edc:name="CALC" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADTMD0" edc:desc="" edc:mask="0x1" edc:name="ADTMD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADTMD1" edc:desc="" edc:mask="0x1" edc:name="ADTMD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADTMD2" edc:desc="" edc:mask="0x1" edc:name="ADTMD2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADSOI" edc:mask="0x1" edc:name="ADSOI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCALC0" edc:desc="" edc:mask="0x1" edc:name="ADCALC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCALC1" edc:desc="" edc:mask="0x1" edc:name="ADCALC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCALC2" edc:desc="" edc:mask="0x1" edc:name="ADCALC2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ADTMD" edc:mask="0x7" edc:name="ADTMD" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCALC" edc:mask="0x7" edc:name="ADCALC" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="TMD0" edc:mask="0x1" edc:name="TMD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMD1" edc:mask="0x1" edc:name="TMD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMD2" edc:mask="0x1" edc:name="TMD2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CALC0" edc:mask="0x1" edc:name="CALC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CALC1" edc:mask="0x1" edc:name="CALC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CALC2" edc:mask="0x1" edc:name="CALC2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrc-rrr" edc:cname="ADSTAT" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="ADSTAT" edc:nzwidth="8" edc:por="0000-000" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3F7">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STAT" edc:desc="" edc:mask="0x7" edc:name="STAT" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="MATH" edc:desc="" edc:mask="0x1" edc:name="MATH" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LTHR" edc:desc="" edc:mask="0x1" edc:name="LTHR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UTHR" edc:desc="" edc:mask="0x1" edc:name="UTHR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AOV" edc:desc="" edc:mask="0x1" edc:name="AOV" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADSTAT0" edc:desc="" edc:mask="0x1" edc:name="ADSTAT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADSTAT1" edc:desc="" edc:mask="0x1" edc:name="ADSTAT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADSTAT2" edc:desc="" edc:mask="0x1" edc:name="ADSTAT2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ADMATH" edc:mask="0x1" edc:name="ADMATH" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADLTHR" edc:mask="0x1" edc:name="ADLTHR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADUTHR" edc:mask="0x1" edc:name="ADUTHR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADAOV" edc:mask="0x1" edc:name="ADAOV" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ADSTAT" edc:mask="0x7" edc:name="ADSTAT" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="ADOV" edc:mask="0x1" edc:name="ADOV" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="STAT0" edc:mask="0x1" edc:name="STAT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STAT1" edc:mask="0x1" edc:name="STAT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STAT2" edc:mask="0x1" edc:name="STAT2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="OV" edc:mask="0x1" edc:name="OV" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---n--nn" edc:cname="ADREF" edc:desc="" edc:impl="0x13" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---0--00" edc:name="ADREF" edc:nzwidth="8" edc:por="---0--00" edc:_modsrc="DOS-03191_adc_sarcore_mp_ctrl_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x22" edc:_addr="0x3F8">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PREF" edc:mask="0x3" edc:name="PREF" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="NREF" edc:mask="0x1" edc:name="NREF" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADPREF" edc:mask="0x3" edc:name="ADPREF" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="ADNREF" edc:mask="0x1" edc:name="ADNREF" edc:nzwidth="0x4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PREF0" edc:mask="0x1" edc:name="PREF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PREF1" edc:mask="0x1" edc:name="PREF1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="NREF0" edc:mask="0x1" edc:name="NREF0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="ADPREF0" edc:mask="0x1" edc:name="ADPREF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADPREF1" edc:mask="0x1" edc:name="ADPREF1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADNREF0" edc:mask="0x1" edc:name="ADNREF0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
